models/deepseek-v2-lite/benchmark_results/p95_stress_20260315_120241/p95_stress.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x74c6bdb3d9e0>, seed=1132, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15840, random_output_len=561, random_range_ratio=0.0, random_prefix_len=12000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p95_stress_20260315_120241', result_filename='p95_rate1_20260315_120241.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-843a5842-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 12:05:36 [datasets.py:611] Sampling input_len from [15839, 15839] and output_len from [561, 561]
Token indices sequence length is longer than the specified maximum sequence length for this model (29000 > 16384). Running this sequence through the model will result in indexing errors
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [04:22<00:00,  1.31s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  262.74    
Total input tokens:                      5567800   
Total generated tokens:                  112200    
Request throughput (req/s):              0.76      
Output token throughput (tok/s):         427.05    
Peak output token throughput (tok/s):    501.00    
Peak concurrent requests:                56.00     
Total token throughput (tok/s):          21618.69  
---------------Time to First Token----------------
Mean TTFT (ms):                          23280.86  
Median TTFT (ms):                        24172.00  
P50 TTFT (ms):                           24172.00  
P90 TTFT (ms):                           37169.64  
P95 TTFT (ms):                           39893.47  
P99 TTFT (ms):                           44593.81  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.78     
Median TPOT (ms):                        39.18     
P50 TPOT (ms):                           39.18     
P90 TPOT (ms):                           39.50     
P95 TPOT (ms):                           39.56     
P99 TPOT (ms):                           39.59     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.78     
Median ITL (ms):                         38.52     
P50 ITL (ms):                            38.52     
P90 ITL (ms):                            40.02     
P95 ITL (ms):                            41.88     
P99 ITL (ms):                            72.00     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          44996.27  
Median E2EL (ms):                        46219.62  
P50 E2EL (ms):                           46219.62  
P90 E2EL (ms):                           59286.30  
P95 E2EL (ms):                           61264.94  
P99 E2EL (ms):                           64598.84  
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7603e44616c0>, seed=1132, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15840, random_output_len=561, random_range_ratio=0.0, random_prefix_len=12000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=3.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p95_stress_20260315_120241', result_filename='p95_rate3_20260315_120241.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-42af77d6-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 12:12:00 [datasets.py:611] Sampling input_len from [15839, 15839] and output_len from [561, 561]
Token indices sequence length is longer than the specified maximum sequence length for this model (29000 > 16384). Running this sequence through the model will result in indexing errors
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 3.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [03:06<00:00,  1.07it/s]
Failed requests during benchmark run detected (capping to 10):
Error 0: Bad Gateway
Error 1: Bad Gateway
Error 2: Bad Gateway
Error 3: Bad Gateway
Error 4: Bad Gateway
Error 5: Bad Gateway
Error 6: Bad Gateway
Error 7: Bad Gateway
Error 8: Bad Gateway
Error 9: Bad Gateway
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     136       
Failed requests:                         64        
Request rate configured (RPS):           3.00      
Benchmark duration (s):                  186.68    
Total input tokens:                      3786104   
Total generated tokens:                  76296     
Request throughput (req/s):              0.73      
Output token throughput (tok/s):         408.71    
Peak output token throughput (tok/s):    509.00    
Peak concurrent requests:                117.00    
Total token throughput (tok/s):          20690.39  
---------------Time to First Token----------------
Mean TTFT (ms):                          61359.24  
Median TTFT (ms):                        63053.50  
P50 TTFT (ms):                           63053.50  
P90 TTFT (ms):                           106669.45 
P95 TTFT (ms):                           112877.08 
P99 TTFT (ms):                           118604.43 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.53     
Median TPOT (ms):                        39.11     
P50 TPOT (ms):                           39.11     
P90 TPOT (ms):                           39.44     
P95 TPOT (ms):                           39.47     
P99 TPOT (ms):                           39.49     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.53     
Median ITL (ms):                         38.35     
P50 ITL (ms):                            38.35     
P90 ITL (ms):                            39.56     
P95 ITL (ms):                            40.98     
P99 ITL (ms):                            72.04     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          82934.05  
Median E2EL (ms):                        85125.30  
P50 E2EL (ms):                           85125.30  
P90 E2EL (ms):                           128525.30 
P95 E2EL (ms):                           133952.46 
P99 E2EL (ms):                           138275.91 
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7c7574d556c0>, seed=1132, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15840, random_output_len=561, random_range_ratio=0.0, random_prefix_len=12000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p95_stress_20260315_120241', result_filename='p95_rate5_20260315_120241.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-0c8a394d-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 12:17:08 [datasets.py:611] Sampling input_len from [15839, 15839] and output_len from [561, 561]
Token indices sequence length is longer than the specified maximum sequence length for this model (29000 > 16384). Running this sequence through the model will result in indexing errors
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [02:43<00:00,  1.23it/s]
Failed requests during benchmark run detected (capping to 10):
Error 0: Bad Gateway
Error 1: Bad Gateway
Error 2: Bad Gateway
Error 3: Bad Gateway
Error 4: Bad Gateway
Error 5: Bad Gateway
Error 6: Bad Gateway
Error 7: Bad Gateway
Error 8: Bad Gateway
Error 9: Bad Gateway
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     118       
Failed requests:                         82        
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  163.25    
Total input tokens:                      3285002   
Total generated tokens:                  66198     
Request throughput (req/s):              0.72      
Output token throughput (tok/s):         405.49    
Peak output token throughput (tok/s):    498.00    
Peak concurrent requests:                115.00    
Total token throughput (tok/s):          20527.67  
---------------Time to First Token----------------
Mean TTFT (ms):                          61333.77  
Median TTFT (ms):                        61534.53  
P50 TTFT (ms):                           61534.53  
P90 TTFT (ms):                           107186.04 
P95 TTFT (ms):                           113598.93 
P99 TTFT (ms):                           118041.04 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.27     
Median TPOT (ms):                        38.48     
P50 TPOT (ms):                           38.48     
P90 TPOT (ms):                           39.42     
P95 TPOT (ms):                           39.49     
P99 TPOT (ms):                           39.52     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.28     
Median ITL (ms):                         38.30     
P50 ITL (ms):                            38.30     
P90 ITL (ms):                            39.69     
P95 ITL (ms):                            41.22     
P99 ITL (ms):                            70.92     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          82766.56  
Median E2EL (ms):                        83460.32  
P50 E2EL (ms):                           83460.32  
P90 E2EL (ms):                           128757.09 
P95 E2EL (ms):                           134512.72 
P99 E2EL (ms):                           137781.21 
==================================================